src/Reports/ОтчетПоНормамКанбановСтарый/ОтчетПоНормамКанбановСтарый.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Report>
  <name>ОтчетПоНормамКанбановСтарый</name>
  <attributes>
    <name>НаДату</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВидКанбана</name>
    <type>
      <types>CatalogRef.ВидыКанбанов</types>
    </type>
  </attributes>
  <attributes>
    <name>ТехОперация</name>
    <type>
      <types>CatalogRef.ТехОперации</types>
    </type>
  </attributes>
</mdclass:Report>

src/InformationRegisters/НормыТО/НормыТО.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>НормыТО</name>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <resources>
    <name>Норма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>8</precision>
        <scale>4</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Стоимость</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>8</precision>
        <scale>4</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>МашинноеВремя</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>НормаВремениНаНастройку</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>НормаВремениНаОбдув</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>ТехОперация</name>
    <type>
      <types>CatalogRef.ТехОперации</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/InformationRegisters/НормыВремени/НормыВремени.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>НормыВремени</name>
  <informationRegisterPeriodicity>Month</informationRegisterPeriodicity>
  <resources>
    <name>НормаВремени</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>7</precision>
        <scale>4</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>НормаВремениНаПартию</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>7</precision>
        <scale>4</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>МПЗ</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ТехОперация</name>
    <type>
      <types>CatalogRef.ТехОперации</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/Reports/ОтчетПоНормамКанбановСтарый/Forms/ФормаОтчета/Module.bsl
&НаСервере
Функция ПолучитьЭтапУР(ЭтапСпецификации)
НормРасх = ОбщийМодульВызовСервера.ПолучитьНормыРасходовПоВладельцу_Н(ЭтапСпецификации,Отчет.НаДату);
	Пока НормРасх.Следующий() Цикл			
		Если НормРасх.ВидЭлемента = Перечисления.ВидыЭлементовНормРасходов.Основа Тогда 
			Если Найти(НормРасх.Элемент.Наименование,"УР") > 0 Тогда
			Возврат(НормРасх.Элемент);
			КонецЕсли; 
		КонецЕсли; 
	КонецЦикла;
Возврат(Справочники.Номенклатура.ПустаяСсылка()); 
КонецФункции

&НаСервере
Процедура СформироватьНаСервере()
Запрос = Новый Запрос;
СписокНоменклатуры = Новый СписокЗначений;

ТабДок.Очистить();

ОбъектЗн = РеквизитФормыВЗначение("Отчет");
Макет = ОбъектЗн.ПолучитьМакет("Макет");

ОблШапка = Макет.ПолучитьОбласть("Шапка");
ОблМПЗ = Макет.ПолучитьОбласть("МПЗ");
ОблКонец = Макет.ПолучитьОбласть("Конец");	

ОблШапка.Параметры.НаДату = Формат(Отчет.НаДату,"ДФ=dd.MM.yyyy");
ОблШапка.Параметры.ТО = Отчет.ТехОперация;
НормыТО = РегистрыСведений.НормыТО.ПолучитьПоследнее(Отчет.НаДату,Новый Структура("ТехОперация",Отчет.ТехОперация));
ОблШапка.Параметры.ТарифнаяСтавка = НормыТО.Стоимость;
ТабДок.Вывести(ОблШапка);

Запрос.Текст = 
	"ВЫБРАТЬ
	|	Номенклатура.Ссылка КАК Ссылка
	|ИЗ
	|	РегистрСведений.СтатусыМПЗ.СрезПоследних(&НаДату, ) КАК СтатусыМПЗСрезПоследних
	|		ПОЛНОЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК Номенклатура
	|		ПО СтатусыМПЗСрезПоследних.МПЗ = Номенклатура.Ссылка
	|ГДЕ
	|	Номенклатура.Канбан = &ВидКанбана";
Запрос.УстановитьПараметр("ВидКанбана",Отчет.ВидКанбана);
Запрос.УстановитьПараметр("НаДату", ТекущаяДата());
	Если Не ПоказыватьЗапрещённые Тогда
	Запрос.Текст = Запрос.Текст + " И СтатусыМПЗСрезПоследних.Статус <> &Статус";	
	Запрос.УстановитьПараметр("Статус",Перечисления.СтатусыСпецификаций.Запрещённая);
	КонецЕсли; 
РезультатЗапроса = Запрос.Выполнить();
ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
	СписокНоменклатуры.Добавить(ВыборкаДетальныеЗаписи.Ссылка,глНаименованиеВСкобкахБезЭтапа(ВыборкаДетальныеЗаписи.Ссылка.Наименование));
	КонецЦикла;
СписокНоменклатуры.СортироватьПоПредставлению();
	Для каждого МПЗ Из СписокНоменклатуры Цикл 
	ОблМПЗ.Параметры.НаименованиеРМ = СокрЛП(МПЗ.Значение.Наименование);
	ОблМПЗ.Параметры.МПЗ_РМ = МПЗ.Значение;
	ОблМПЗ.Параметры.Статус = ПолучитьСтатус(МПЗ.Значение);
	НормыВремени = РегистрыСведений.НормыВремени.ПолучитьПоследнее(Отчет.НаДату,Новый Структура("МПЗ,ТехОперация",МПЗ.Значение,Отчет.ТехОперация));
	НВ = НормыВремени.НормаВремени;
	ОблМПЗ.Параметры.НВ_РМ = НВ;
	УР = ПолучитьЭтапУР(МПЗ.Значение);
	ОблМПЗ.Параметры.НаименованиеУР = СокрЛП(УР.Наименование);
	ОблМПЗ.Параметры.МПЗ_УР = УР;
		Если Не УР.Пустая() Тогда
		НормыВремени = РегистрыСведений.НормыВремени.ПолучитьПоследнее(Отчет.НаДату,Новый Структура("МПЗ,ТехОперация",УР,Отчет.ТехОперация));
		ОблМПЗ.Параметры.НВ_УР = НормыВремени.НормаВремени;
		НВ = НВ + НормыВремени.НормаВремени;
		Иначе
		ОблМПЗ.Параметры.НВ_УР = 0;
		КонецЕсли; 
	ОблМПЗ.Параметры.Трудоёмкость = НВ;
	ОблМПЗ.Параметры.Расценка = НВ/60*НормыТО.Стоимость;
	ТекОбл = ТабДок.Вывести(ОблМПЗ);
		Если Не ЗначениеЗаполнено(ОблМПЗ.Параметры.НВ_РМ) Тогда
		ТабДок.Область(ТекОбл.Верх, ТекОбл.Лево, ТекОбл.Низ, 4).ЦветФона = WEBЦвета.Красный;
		КонецЕсли;
			Если (Не УР.Пустая()) и (Не ЗначениеЗаполнено(ОблМПЗ.Параметры.НВ_УР)) Тогда
			ТабДок.Область(ТекОбл.Верх, ТекОбл.Лево, ТекОбл.Низ, 5).ЦветФона = WEBЦвета.Красный;
			КонецЕсли;
	КонецЦикла;
ТабДок.Вывести(ОблКонец);
ТабДок.ФиксацияСверху = 3;
КонецПроцедуры

&НаКлиенте
Процедура Сформировать(Команда)
	Если ЭтаФорма.ПроверитьЗаполнение() Тогда
	СформироватьНаСервере();
	КонецЕсли; 
КонецПроцедуры

&НаКлиенте
Процедура НаДатуНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
СтандартнаяОбработка = Ложь;
Ф = ПолучитьФорму("ОбщаяФорма.ВыборМесяца");
Результат = Ф.ОткрытьМодально();
	Если Результат <> Неопределено Тогда
	Отчет.НаДату = НачалоМесяца(Результат);
	КонецЕсли;
КонецПроцедуры
